-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jun 08, 2022 at 04:36 PM
-- Server version: 10.4.21-MariaDB
-- PHP Version: 7.3.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `herb`
--

-- --------------------------------------------------------

--
-- Table structure for table `accountpm`
--

CREATE TABLE `accountpm` (
  `addminID` int(11) NOT NULL,
  `Email` varchar(50) NOT NULL DEFAULT '',
  `pass` varchar(20) NOT NULL DEFAULT '',
  `nameStd` varchar(255) DEFAULT NULL,
  `surnameStd` varchar(255) DEFAULT NULL,
  `idStd` varchar(14) DEFAULT '',
  `role` varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `accountpm`
--

INSERT INTO `accountpm` (`addminID`, `Email`, `pass`, `nameStd`, `surnameStd`, `idStd`, `role`) VALUES
(10499, '1162304620013@mail.rmutt.ac.th', '321', 'กัญญารัตน์', 'สังขพันธ์', '116230462001-3', 'admin'),
(10500, 'asdcc', 'asdcc', 'สุเมธ', 'หงษ์นาค', '116230462034-4', 'admin');

-- --------------------------------------------------------

--
-- Table structure for table `detail`
--

CREATE TABLE `detail` (
  `herbID` int(11) NOT NULL,
  `leaves` text DEFAULT '',
  `flower` text DEFAULT '',
  `fruit` text DEFAULT '',
  `haulm` text DEFAULT '',
  `rootHerb` text DEFAULT '',
  `propagating` text DEFAULT '',
  `feature` text DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `detail`
--

INSERT INTO `detail` (`herbID`, `leaves`, `flower`, `fruit`, `haulm`, `rootHerb`, `propagating`, `feature`) VALUES
(10500, 'ใบ เป็นใบเดี่ยวสีเขียวรูปร่างคล้ายหัวใจขอบหยักมี 3 หรือ 5 แฉก ผิวเรียบเป็นมัน ก้านใบสั้นปลายใบเป็นติ่งแหลม มีเส้นใบออกจากจุดเดียวกันที่โคนใบ 5 - 7 เส้น', 'ดอก ออกดอกเดี่ยวหรือออกเป็นคู่ที่ซอกใบ ดอกมีสีขาวทรงกระบอกหัวแฉก ดอกตัวผู้และดอกตัวเมียคล้ายกันแต่อยู่คนละต้น', 'ผล มีลักษณะรูปร่างคล้ายแตงกวา ผลอ่อนจะมีสีเขียว ผลสุกจะมีสีแดง\r\nและมีเมล็ดรูปไข่แบนเปลือกแข็งมีจำนวนมาก\r\n', 'ต้น มีลักษณะเป็นเถาไม้เลื้อย ลำต้นเล็ก มีมือเกาะ', '', 'ตำลึงเป็นพืชพื้นเมืองของเอเชียตะวันออกเขตร้อนและแอฟริกาเขตร้อนในประเทศไทยสามารถพบได้ทั่วไป ขยายพันธุ์โดยใช้เมล็ดหรือการเพาะชำเถาแก่', 'ดอก โขลกเป็นยาทาแก้คัน\r\nทั้งต้น นำมาใช้เป็นยารักษาโรคผิวหนัง แก้หลอดลมอักเสบ รักษาโรคเบาหวาน\r\nใบ ใบของต้นเพศผู้ใช้ผสมเย็นยาเขียว แก้ไข้ แก้ผดผื่นคัน แก้ปววดแสบปวดร้อน แก้พิษแมลงสัตว์กัดต่อย รักษาโรคผิวหนัง รักษาโรคงูสวัด รักษาโรคเริม ขับเสมหะ และยังช่วยบำรุงสายตา\r\nผล รักษาโรคเบาหวาน แก้ฝีดาษ แก้ไข้หอบ ไข้อีเสา\r\nเมล็ด รักษาโรคโลหิต\r\nราก น้ำต้มรากกินเป็นยาเย็น แก้ไข้ แก้อาเจียน แก้ตาฝ้า รักษาโรคเบาหวาน ดับพิษ\r\nข้อควรระวัง\r\n-	ตำลึงที่ใช้เป็นผักนิยมใช้ชนิดตัวเมีย ส่วนชนิดตัวผู้นั้นจะใช้เป็นสมุนไพรเท่านั้น\r\n-	มีการศึกษาวิจัยพบว่าใบและยอดของตำลึงมีฤทธิ์ช่วยการกระตุ้นการเคลื่อนไหวของลำไส้ ดังนั้นในการนำมาบริโภคเพื่อเป็นอาหารหรือใช้เป็นสมุนไพรไม่ควรรับประทานมากจนเกินไปเพราะอาจทำให้ท้องเสียได้\r\n-	การทาน้ำตำลึงเพื่อแก้คันหรือรักษาโรคผิวหนังต่างๆไม่ควรถูแรงจนเกินไปในบริเวณที่เป็นผิวบอบบาง เพราะอาจทำให้เกิดอาการแพ้หรือการอักเสบขึ้น\r\n'),
(10501, 'ใบ ใบเดี่ยว ออกเรียงเวียนรอบต้น ใบหนาและรูปร่างยาว โคนใบใหญ่ ปลายใบแหลม ริมใบหยักและมีหนาม ขอบใบเป็นหนามแหลมห่างกัน แผ่นใบสีเขียวใสและมีรอยกระสีขาว ใบจะอุ้มน้ำได้ดี ภายในมีวุ้นและเมือกใสสีเขียวอ่อนๆ', 'ดอก จะออกดอกในช่วงฤดูหนาว ดอกมีหลายสีคละกัน และเปลี่ยนไปตามอายุดอก ได้แก่ สีเหลือง สีส้ม และสีแดงออกดอกเป็นช่อกระจายที่ปลายยอด ก้านช่อดอกยาวมากชูตั้งตรง ดอกเป็นหลอดปลาย บานจากข้างล่างขื้นข้างบน คล้ายดอกซ่อนกลิ่น โคนเชื่อมติดกันเป็นหลอด ปลายแยกเป็น 6 แฉก เรียงเป็น 2 ชั้น รูปแตร', 'ผล เป็นผลแห้ง รูปกระสวย', '', '', 'ว่านหางจระเข้นั้นมีถิ่นกำเนิดแถวบริเวณตอนใต้ของทวีปแอฟริกาว่านห่างจระเข้เป็นพืชชนิดเดียวกับพลับพลึง หัวหอม การขยายพันธุ์ว่านหางจระเข้ สามารถทำได้หลายวิธี เช่น การแยกหน่อ, การตัดเหง้า, การปักชำยอดและการเพาะเลี้ยงเนื้อเยื่อ แต่วิธีที่เป็นที่นิยมและสะดวกที่สุด คือ การขยายพันธุ์ด้วยวิธีการแยกหน่อของว่านหางจระเข้ว่านหางจระเข้จะสามารถเติบโตได้ดีในฤดูหนาว การปลูกควรเป็นดินปนทราย เพราะจะระบายน้ำได้ดี', 'ใบ : โขลกผสมสุราพอกฝี วุ้นจากใบล้างด้วยน้ำสะอาดทาหรือฝานบางๆ ปิดหรือทาแผลไฟไหม้ น้ำร้อนลวก ดับพิษร้อน ทาผิวป้องกันและรักษาอาการไหม้จากแสงแดด \r\nทั้งต้น : ดองสุราดื่มขับน้ำคาวปลา\r\nราก : รสขมขื่น รับประทานถ่ายโรคหนองใน แก้มุตกิด ช้ำรั่ว \r\nยางในใบ : เป็นยาระบาย\r\nน้ำวุ้นจากใบ : ล้างด้วยน้ำสะอาด ฝานบางๆ รักษาแผลสดภายนอก น้ำร้อนลวก ไฟไหม้ ทำให้แผลเป็นจางลง ดับพิษร้อน ทาผิวป้องกันและรักษาอาการไหม้จากแสงแดด ทาผิวรักษาสิวฝ้า และขจัดรอยแผลเป็น\r\nเนื้อวุ้น : เหน็บทวาร รักษาริดสีดวงทวาร\r\nเหง้า :	ต้มรับประทานแก้หนองใน โรคมุตกิด\r\nข้อควรระวัง\r\n-	ไม่ควรใช้ในหญิงที่ตั้งครรภ์และสตรีที่ให้นมบุตร\r\n-	การรับประทานในปริมาณมากทำให้เกิดความผิดปกติที่เฉียบพลันของระบบทางเดินอาหารได้\r\n-	ผู้ป่วยที่เป็นโรคหัวใจและหลอดเลือดรุนแรงไม่ควรรับประทาน\r\n-	ผู้ที่มีความดันโลหิตสูงไม่ควรรับประทาน\r\n-	การนำวุ้นใสของว่านหางจระเข้มาทาผิวหน้า หรือเส้นผม ต้องล้างน้ำยางสีเหลืองออกให้หมด\r\n'),
(10502, 'ใบ เป็นใบเดี่ยว ออกเรียงสลับ แคบยาว กว้าง 1 - 2 ซม. ยาว 70 - 100 ซม. ลักษณะใบรูปใบหอกแกมรูปไข่หรือรูปขอบขนาน ขอบใบเรียบสากคม มีขนเล็กน้อย ปลายใบเรียวแหลม โคนใบสอบเรียวเป็นกาบซ้อนกัน กาบใบสีขาวนวลหรือขาวปนม่วง ยาวและหนาหุ้มข้อและปล้องไว้แน่น แผ่นใบสีเขียว มีเส้นใบขนานตามยาว สีขาวนวล เส้นกลางใบแข็ง ผิวใบสากทั้งสองด้าน มีกลิ่นหอมเฉพาะ', 'ดอก ออกดอกเป็นช่อแบบช่อแยกแขนง ที่ปลายยอด มีช่อดอกย่อย 1 – 12 ช่อ และมีใบประดับ รองรับ ช่อดอกย่อยแบนออกเป็นคู่ ช่อหนึ่งไม่มีก้าน และอีกช่อหนึ่งมีก้าน มีรังไข่แบบเหนือวงกลีบ ออกดอกยาก', 'ผล เป็นผลแห้งแบบธัญพืช เมล็ดเดี่ยว', 'เป็นไม้ล้มลุก ประเภทหญ้า อายุหลายปี สูงประมาณ 0.7 – 1.0 เมตร เหง้าใต้ดินมีกลิ่นเฉพาะ ลำต้นเป็นกอใหญ่มีข้อเห็นชัดเจน ข้อและปล้องสั้นมาก มีไขปกคลุมตามข้อ ลักษณะเป็นแท่งทรงกระบอก ยาว แข็ง และเกลี้ยง', '', 'ตะไคร้เป็นพืชที่มีถิ่นกำเนิดในแถบเขตร้อนของทวีปเอเชีย เช่น ไทย , พม่า , ลาว , มาเลเซีย , อินโดนีเซีย เป็นต้นและยังสามารถพบได้ในประเทศเขตร้อนบางประเทศในแถบอเมริกาใต้ ตะไคร้สามารถขยายพันธุ์ได้ด้วย การปักชำต้นเหง้าตะไคร้ชอบดินร่วนซุย แต่ก็สามารถเจริญได้ในดินเกือบทุกชนิดเป็นพืชที่ดูแลง่ายชอบน้ำชอบแดดจ้า เป็นพืชทนแล้งได้ดี และเป็นพืชที่มีโรคน้อย', 'คนกาบใบและลำต้น ใช้เป็นยาขับลม แก้ท้องอืดเฟ้อแน่นจุกเสียด\r\nใบ ใบสดใช้เป็นยาช่วยลดความดันฌโลหิต และแก้ไข้\r\nลำต้น เป็นยาขับลม แก้โรคทางเดินปัสสาวะ แก้นิ่ว แก้ผมแตกปลาย แก้เบื่ออาหาร ทำให้เจริญอาหาร ขับเหงื่อ แก้ดับกลิ่นคาวในอาหาร\r\nทั้งต้น แก้ปวดท้อง รักษาโรคหืด แก้อหิวาตกโรค แก้โรคระบบทางเดินปัสสาวะ หรือใช้ทำเป็นยานวด ใช้ร่วมกับสมุนไพรอื่นรักษาโรค เช่น เป็นยาบำรุงธาตุ ขับเหงื่อ เจริญอาหาร\r\nเหง้า แก้ท้องอืด ท้องเฟ้อ และแน่นจุกเสียด แก้เกระษัย แก้เบื่ออาหาร แก้อาเจียนสำหรับหญิงที่ตั้งครรภ์ เป็นยานอนหลับ ยาบำรุง แก้ปวดท้อง ขับปัสสาวะและนิ่ว ขับลมในลำไส้\r\nราก เป็นยาแก้ปวดท้อง แก้เสียดแน่น บำรุงไฟธาตุ ขับปัสสาวะ ขับนิ่ว รักษาเกลื้อน\r\nข้อควรระวัง\r\n-	การบริโภคตะไคร้หรือการใช้ตะไคร้ทาบนผิวหนังเพื่อจุดประสงค์ทางการรักษาโรค อาจจะปลอดภัยหากใช้ตะไคร้ในช่วงเวลาสั้น ๆ ภายใต้การดูแลและคำแนะนำจากแพทย์\r\n-	การสูดดมสารที่มีส่วนประกอบของตะไคร้ อาจทำให้เกิดผลข้างเคียงที่เป็นอันตรายและเป็นพิษต่อร่างกายได้ในผู้ป่วยบางราย เช่น ผู้มีปัญหาเกี่ยวกับสุขภาพปอดปรึกษาแพทย์ เภสัชและศึกษาข้อมูลบนฉลากให้ถี่ถ้วนก่อนใช้ผลิตภัณฑ์ใด ๆ ที่มีสารสกัดมาจากตะไคร้ก่อนเสมอเพื่อหลีกเลี่ยงการเกิดผลข้างเคียงที่อาจเป็นอันตรายต่อสุขภาพหลังการบริโภค\r\n'),
(10503, 'ใบ เป็นใบเดี่ยว ออกเรียงสลับตามข้อใบ ลักษณะใบรูปไข่หรือรูปหัวใจคล้ายใบโพธิ์ ฐานใบมนกลม ปลายใบแหลม ขอบใบเรียบ แผ่นใบด้านบนมีสีเข้มกว่าใบด้านล่าง เรียบและเป็นมัน มีเส้นใบประมาณ 5-7 เส้น เส้นใบด้านบนจะบุ๋มลงไปตลอดแผ่นใบ ส่วนผิวใบด้านล่างจะนูนออกมา ใบอ่อนจะเป็นสีเขียวและใบแก่สีจะเข้มขึ้น และมีกลิ่นฉุน', 'ดอก ออกดอกเป็นช่อแบบแกนห้อยลงที่ซอกใบ ดอกมีขนาดเล็กสีขาว ไม่มีก้าน รูปร่างของดอกเป็นรูปทรงกระบอกออกเป็นกลุ่มเรียงอยู่บนก้านช่อดอก ดอกเพศผู้และดอกเพศเมียจะแยกกันอยู่คนละดอก', 'ผล ลักษณะผลรูปทรงกลม เป็นผลมีเนื้อ เบียดกันแน่นอยู่บนแกน เมื่อสุกมีสีแดง และมีเมล็ดรูปร่างค่อนข้างกลมหรือยาวรีคล้ายรูปไข่\r\n', 'พลูเป็นพืชวงศ์เดียวกับพริกไทยจัดเป็นไม้เถาเลื้อยเนื้อแข็ง ลำต้นเกลี้ยงเป็นปล้อง และมีข้อลำต้นมีลักษณะอวบน้ำมีร่องเล็กๆสีน้ำตาลอมแดงตามแนวยาวของลำต้นโดยมีรากยึดเกาะที่ออกตามขอของลำต้นบางครั้งเรียกว่า รากตุ๊กแก ใช้สำหรับยึดเกาะวัสดุสำหรับช่วยพยุงลำต้น', '', 'พลูมีถิ่นกำเนิดในเขตร้อนชื้นในแถบเอเชียใต้ เช่น ประเทศอินเดีย ศรีลังกา บังคลาเทศ ฯลฯ ส่วนในประเทศไทยพลูพบได้ทั่วไปในทั่วทุกภาคและมีแหล่งเพาะปลูกที่สำคัญในประเทศคือ ในจังหวัดฉะเชิงเทรา ปราจีนบุรี นครนายก นครปฐม กรุงเทพมหานคร มหาสารคาม ขอนแก่น และนครราชสีมา พลูสามารถปลูก และขยายพันธุ์ใหม่ด้วยการปักชำกิ่งพลูจะสามารถเจริญเติบโตได้ดีในสภาพของดินร่วนที่มีอินทรียวัตถุมาก', 'ใบ : เคี้ยวกินกับหมาก ขยี้แล้วใช้อุดจมูก ช่วยห้ามเลือดกำเดาให้หยุดไหล แก้ปวดฟัน แก้รำมะนาด แก้ปากเหม็น ขับลมในลำไส้ แก้ท้องอืดท้องเฟ้อ แก้ปวดศีรษะ แก้ปวดท้อง ท้องเสีย กระตุ้นให้กระปรี้กระเปร่า ใช้ภายนอก แก้ปวด บวม ฟกช้ำ ฆ่าเชื้อโรค เป็นยาชาเฉพาะที่ ช่วยให้เส้นเลือดหดตัว ฆ่าเชื้อโรคหนอง ฝี วัณโรค แก้การอักเสบของเยื่อจมูกและคอ แก้กลาก แก้ฮ่องกงฟุต แก้คัน แมลงกัดต่อย แก้ลมพิษ ลนไฟนาบท้องเด็ก แก้ปวดท้องและแก้ลูกอัณฑะยาน บรรเทาอาการไอมีเสมหะ แก้คัดจมูก เจ็บคอ\r\nน้ำคั้นจากใบ : เป็นยาถ่ายพยาธิ ยาระบายอาการท้องผูก ยาเจริญอาหาร ขับเสมหะ ลดไข้ แก้ปวดศรีษะ ขับลมในกระเพาะอาหาร ทำให้ลมหายใจหอมสดชื่น เป็นยาสมานแผล และใช้ป้องกันเชื้อจุลินทรีย์แก้อาการผื่นคัน ลมพิษ แพ้ อักเสบ แมลงสัตว์กัด แก้ท้องอืดท้องเฟ้อ แน่น จุกเสียด แก้ตาแดง แก้วิงเวียน\r\nราก : ใช้รักษาโรคเอดส์\r\nข้อควรระวัง\r\n-	การเก็บใบพลู มาใช้ควรเก็บตอนสาย เพราะเป็นช่วงที่ใบมีการสังเคราะห์แสงสมบูรณ์ โดยเลือกเก็บเฉพาะใบที่มีสีเขียวเข้ม ไม่ควรเก็บใบอ่อนบริเวณยอดหรือเก็บใบแก่ที่เหลืองแล้ว เพราะใบเหล่านี้จะมีสารเคมี หรือน้ำมันหอมระเหยน้อย\r\n-	ในผู้ที่แพ้ยางของพืชประเภท ชะพลู พริกไทย ควรระมัดระวังไม่ให้โดนยางของพลูด้วยเช่นกันเพราะเป็นพืชในวงศ์เดียวกันอาจทำให้เกิดการแพ้ได้\r\n-	การใช้พลูในรูปแบบสมุนไพรเพื่อการรักษาโรคควรใช้ในขนาดและปริมาณที่พอเหมาะไม่ใช้มากหรือใช้เป็นระยะเวลานานเกินไป\r\n-	สำหรับผู้ที่มีโรคประจำตัว สตรีมีครรภ์ หรือสตรีให้นมบุตร ควรปรึกษาแพทย์และผู้เชี่ยวชาญก่อนใช้\r\n'),
(10504, 'ใบ เป็นใบเดี่ยว แตกใบออกตรงข้ามในแต่ละข้อของลำต้นและกิ่ง ลักษณะใบรูปรีหรือรูปไข่ค่อนข้างยาว ปลายใบแหลม โคนใบรูปลิ่มหรือมน ขอบใบจักฟันเลื่อยและเป็นคลื่น แผ่นใบบางสีเขียวหรือสีแดง และมีขนปกคลุมทั้งสองด้าน ก้านใบสีเขียวหรือสีแดงแล้วแต่พันธุ์', 'ดอก ออกดอกเป็นช่อแบบช่อฉัตร ออกช่อที่ยอดหรือปลายกิ่ง ริ้วประดับรูปไข่หรือรูปหัวใจ ปลายแหลม ขอบมีขน ดอกย่อยแบบสมมาตรด้านข้าง ก้านดอกโค้งยาวมีขน มีกลีบเลี้ยงเชื่อมติดกันเป็นหลอดปลายแยกเป็นปาก กลีบดอกสีขาวอมม่วงหรือสีม่วงเชื่อมติดกันเป็นรูประฆังปลายแยกเป็นปาก ปากบนมีแฉกมนๆ 4 แฉก ปากล่างโค้งลง แบน ขอบเรียบ ดอกกะเพราแดงสีเข้มกว่ากะเพราขาว', 'ผล เป็นแบบผลเปลือกแห้งเมล็ดเดียว มีขนาดเล็ก ปลายมน เกลี้ยง\r\nและมีเมล็ดขนาดเล็ก รูปไข่ สีน้ำตาลมีจุดสีเข้ม หุ้มด้วยกลีบเลี้ยงของเมล็ด\r\n', 'เป็นไม้พุ่ม ขนาดเล็ก โคนต้นแข็ง มีขนคลุมทั่ว แตกกิ่งก้านสาขามาก และมีกลิ่นหอมแรง กะเพรามี 3 พันธุ์ คือ กะเพราะแดง กะเพราขาว และกะเพราลูกผสมระหว่างกะเพราแดงและกะเพราขาว', '', 'ต้นกะเพราเป็นพืชพื้นเมืองของเขตร้อนในบริเวณเขตร้อนของทวีปเอเชียและแอฟริกาพบมากในแถบเอเชียใต้และเอเชียตะวันออกเฉียงใต้ เช่น ประเทศอินเดีย , ศรีลังกา , เนปาล , พม่า , ไทย , ลาว , กัมพูชา ฯลฯ การขยายพันธุ์กะเพราจึงนิยมใช้เมล็ดในการเพาะต้นกล้าขึ้นมา\r\nใบหรือทั้งต้น	ใช้เป็นยาขับลมแก้ปวดท้อง ท้องเสีย และคลื่นไส้อาเจียน นิยมใช้กะเพราแดงมากกว่ากะเพราขาว\r\n', 'ใบ ต้มเอาน้ำดื่มเป็นยาขับลม แก้ท้องอืด ท้องเฟ้อ แก้ปวดท้อง บำรุงธาตุ แก้จุกเสียด แก้ลมตานซาง แก้คลื่นเหียนอาเจียน น้ำคั้นจากใบใช้เป็นยาขับเสมหะ ขับเหงื่อ ขับน้ำดี ช่วยย่อยไขมัน น้ำคั้นจากใบใช้ทาภายนอกแก้โรคผิวหนัง กลาก เกลื้อน รักษาหูด หยอดหูแก้อาการปวดหู ใบแห้งใช้ชงดื่มกับน้ำแก้ท้องอืด ท้องเฟ้อ และน้ำมันจากใบใช้เป็นยาฆ่ายุงได้ซึ่งมีฤทธิ์ได้นาน 2 ชั่วโมง หรือไล่แมลงวันทอง บดเป็นยานัตถุ์ แก้คัดจมูก ยาชงหรือน้ำต้มใบใช้แก้ตับอักเสบและบำรุงธาตุสำหรับเด็ก\r\nดอก ผสมกับน้ำผึ้งรับประทานแก้หลอดลมอักเสบ\r\nเมล็ด เป็นยาขับลม แก้ท้องอืดท้องเฟ้อ แก้โรคทางเดินปัสสาวะ และไตอักเสบ, เมื่อนำเมล็ดไปแช่น้ำจะพองตัวเป็นเมือกขาวใช้พอกบริเวณตาเมื่อฝุ่นละอองเข้าตาหรือตามีผง และจะไม่ทำให้ตาช้ำ\r\nราก ต้มน้ำดื่มเป็นยาขับเหงื่อในคนไข้โรคมาลาเรีย\r\nข้อควรระวัง\r\n-	น้ำยางกะเพราที่ใช้สำหรับกัดหูดนี้เป็นพิษมาก ดังนั้นควรใช้ด้วยความระวัง อย่าให้เข้าตารวมถึงให้กัดเฉพาะตรงที่เป็นหูด อย่าให้ยางถูกเนื้อดี ถ้าถูกเนื้อดี เนื้อดีจะเน่าเปื่อย ซึ่งรักษาให้หายได้ยาก\r\n-	กะเพรามีอยู่ 2 ชนิด หากนำไปประกอบอาหาร ควรใช้กะเพราะขาว แต่หากต้องการนำไปใช้เป็นสมุนไพรการเลือกกะเพราแดง เพราะมีฤทธิ์ทางยาแรงกว่ากะเพราขาว\r\n-	ในการเลือกใช้กะเพรามาใช้ประโยชน์ควรเลือกกะเพราที่ปลอดสารพิษ หากเป็นไปได้ควรปลูกเพื่อนำไปใช้เองจะดีที่สุด\r\n-	การใช้กะเพราเป็นยาสมุนไพรควรใช้ในปริมาณที่พอเหมาะและไม่ควรใช้ติดต่อกันเป็นเวลานานเกินไปเพราะอาจเป็นอันตรายได้\r\n'),
(10505, 'ใบ ใบออกเป็นใบเดี่ยว มีลักษณะเป็นรูปรียาว ปลายและโคนใบเรียวแหลม ริมขอบใบเรียบ หรือมีหยักเล็กน้อย ใบมีสีเขียวเข้ม', 'ดอก ดอกออกเป็นช่อ ชั้น ๆ คล้ายฉัตร ออกอยู่ตามบริเวณปลายยอด ลักษณะของดอกย่อยมีกลีบเลี้ยง เชื่อมติดกันเป็นหลอด  ส่วนปลายแยกเป็น 5 กลีบ มีสีขาวหรือสีแดงเรื่อ', 'ผล พอดอกร่วงโรยก็จะติดผล เป็นสีน้ำตาล ผลหนึ่งมีเมล็ด .4 เม็ด ลักษณะของเมล็ดเป็น รูปกลมรี', 'เป็นพืชล้มลุก ลำต้นมีขนาดเล็กเป็นพืชที่มีอายุได้หลายฤดู มีลักษณะลำต้นเป็นสี่เหลี่ยมและเป็นพุ่ม ลำต้นจะแตกแขนงได้มากมาย กิ่งก้านมีสีม่วงแดง มีขนอ่อนๆ ที่ผิวลำต้น ใบมีรูปร่างแบบรูปไข่', '', 'โหระพามีถิ่นกำเนิดอยู่ในแถบเอเชียตะวันออกเฉียงใต้คือแถบประเทศไทย ฟิลิปปินส์ อินโดนีเซีย ฯลฯ แต่ได้มีการกระจายพันธุ์ไปทั่วโลก โหระพาสามารถขยายพันธุ์ได้ 3 วิธี คือ การหว่านเมล็ด การเพาะกล้าย้ายปลูกและการปักชำกิ่ง แต่วิธีที่นิยมจะเป็นการปักชำกิ่ง และการเพาะกล้าย้ายปลูก', 'ใบ ใช้ใบคั้นเอาน้ำ 2-4 กรัม ผสมน้ำผึ้ง จิบแก้ไอและหลอดลมอักเสบ ใช้สำลีก้อนเล็กๆ ชุบน้ำคั้นจากใบอุดโพรงฟันที่ปวด แก้ปวดฟัน\r\nราก เผา เป็นเถ้าพอกแก้เด็กเป็นแผลมีหนองเรื้อรัง\r\nเมล็ด ใช้เมล็ดที่แห้ง 2.5-5 กรัม ต้มน้ำหรือแช่น้ำดื่ม ใช้ภายนอก บดเป็นผงแต้มทาถูกน้ำจะพองตัวเป็นเมือกใช้แก้ตาแดง มีขี้ตามาก ต้อตา ใช้เป็นยาระบาย (ใช้เมล็ด 4-12 กรัม แช่น้ำเย็นจนพอง ผสมน้ำหวาน เติมน้ำแข็งรับประทาน)\r\nข้อควรระวัง\r\n-	หญิงตั้งครรภ์ และหญิงที่กำลังให้นมบุตรสามารถรับประทานโหระพาในปริมาณปกติที่พบได้จากอาหารทั่วไปได้อย่างปลอดภัย แต่การใช้ในปริมาณมากอาจก่อให้เกิดอันตรายได้\r\n-	สำหรับสตรีมีครรภ์และเด็กที่มีอายุต่ำกว่า 2 ปี รวมถึงผู้สูงอายุ ควรหลีกเลี่ยงน้ำมันหอมระเหยจากโหระพาเพราะทำให้เกิดอาการแพ้ง่าย\r\n-	ผู้ที่มีเลือดออกผิดปกติอาจเสี่ยงมีเลือดออกมากยิ่งขึ้นเมื่อรับประทานน้ำมันโหระพาหรือสารสกัดจากโหระพา เนื่องจากมีฤทธิ์ชะลอการแข็งตัวของเลือด\r\n-	เมื่อดื่มน้ำโหระพาคั้น อาจจะมีอาการข้างเคียง คือ จะทำให้มึนงงและระคายเคืองคอเล็กน้อย\r\n-	โหระพาอาจมีฤทธิ์ลดความดันโลหิต เพื่อความปลอดภัย ผู้มีความดันโลหิตต่ำควรปรึกษาแพทย์ก่อนใช้ เพราะอาจส่งผลให้มีความดันลดต่ำเกินไปจนเป็นอันตรายได้\r\n'),
(10506, 'ใบ เป็นใบประกอบแบบขนนก ออกเรียงตรงข้าม ลักษณะใบรูปขอบขนาน ด้านบนเกลี้ยง ขอบใบเรียบ ปลายใบมน โคนใบมน แผ่นใบเรียบสีเขียวเข้ม ใบอ่อนมีสีน้ำตาลอมเขียว มีใบย่อยประมาณ 7 – 16 คู่ ปลายสุดมีใบเดียว ก้านใบสีน้ำตาลแดง', 'ดอก ออกดอกเป็นช่อแบบช่อแยกแขนง ออกช่อที่ปลายกิ่ง ดอกจะบานจากโคนช่อไปยังปลายช่อ มีดอกย่อยประมาณ 10 – 20 ดอก กลีบเลี้ยงกลม 3 – 4 กลีบ ปลายมน มีกลีบดอก 5 กลีบ ปลายมน โคนเรียว เกสรตัวผู้10 อัน หลุดร่วงง่าย ดอกมีสีเหลือง มีเกสรยาวยื่นออกมาภายนอก', 'ผล ลักษณะฝักแบนอวบ ยาวและหนาสีน้ำตาล ฝักแห้งจะแตกออกเป็น 2 ซีก คล้ายกับฝักแค\r\nและมีเมล็ด รูปไข่ยาวแบนเรียงตามขวาง มีเมล็ดประมาณ 10 – 30 เมล็ดต่อฝัก สีน้ำตาลแก่\r\n', 'ไม้ต้น ขนาดกลาง ผลัดใบ สูงประมาณ 10 – 15 เมตร เรือนยอดเป็นพุ่มแคบ ๆ ทึบสีเขียวเข้ม ลำต้นมักคดงอเป็นปุ่ม เปลือกต้นสีน้ำตาล หรือสีเทาปนน้ำตาล เนื้อไม้มีสีน้ำตาลแก่เกือบดำ มีรอยแตกตามยาวของลำต้นเป็นร่องตื้น ๆ ยอดอ่อนสีแดงเรื่อ ๆ', '', 'ต้นขี้เหล็กบ้านพบขึ้นอยู่ตามธรรมชาติในหลายประเทศ เดิมเป็นไม้ในบริเวณเอเชียตะวันออกเฉียงใต้นับจากหมู่เกาะต่าง ๆ ของประเทศอินโดนีเซียไปจนกระทั่งถึงประเทศศรีลังกา นิยมปลูกด้วยการเพาะเมล็ดเป็นหลัก เพราะจะให้กิ่งได้มาก แตกยอดอ่อนได้มาก', 'ดอก เป็นยาระบาย ต้มรับประทานเป็นยาทำให้นอนหลับ ลดความดันโลหิต รักษาโรคเส้นประสาท รักษาหืด ล้างศีรษะรักษารังแค โรคโลหิตพิการ ผายธาตุ ขับพยาธิ ดอกตูมเป็นยาทำให้นอนหลับสบายหรือใช้ดอกตูมร่วมกับใบไม่แก่จัดรักษาอาการนอนไม่หลับ ช่วยเจริญอาหาร ลดอาการตื่นเต้นทางประสาท\r\nราก แก้ไข้กลับ ไข้ซ้ำ แก้ไข้ รักษาแผลกามโรค โรคเหน็บขา ทาแก้เส้นอัมพฤกษ์ให้หย่อน แก้ฟกช้ำ บำรุงธาตุ ไข้ผิดสำแดง ผสมในยาขับพยาธิและช่วยระงับอาการชักได้\r\nลำต้นและกิ่ง เป็นยาระบาย รักษาโรคผิวหนัง แก้โรคกระษัย แก้นิ่ว ขับปัสสาวะ ขับระดูขาว\r\nทั้งต้น แก้กระษัย ดับพิษไข้ แก้พิษเสมหะ รักษาโรคหนองใน รักษาอาการตัวเหลือง เป็นยาระบาย บำรุงน้ำดี ทำให้เส้นเอ็นหย่อน\r\nเปลือกต้น รสขม รักษาโรคริดสีดวงทวาร โรคหิด แก้กระษัย ใช้เป็นยาระบาย\r\nแก่น รสขม แก้กามโรค หนองในเข้าข้อออกดอก แผลฝี ขับน้ำคาวปลา ถ่ายพิษ แก้กระษัย ถ่ายเส้น ขับโลหิต แก้เหน็บชา แก้อาการท้องผูก รักษาโรคเบาหวาน โรคหนองใน ใช้เป็นยาระบายชนิดกระตุ้นลำไส้ใหญ่ให้บีบตัว แก้ไฟธาตุพิการ รักษาวัณโรคมะเร็งปอด ปอดอักเสบ มะเร็งลำไส้ มะเร็งกระเพาะอาหาร\r\nใบ รสขม ขับระดูขาว แก้นิ่ว ขับปัสสาวะ รักษาอาการท้องผูก รักษาโรคบิด โรคเบาหวาน แก้ร้อนใน รักษาฝีมะม่วง รักษาโรคเหน็บชา ลดความดันโลหิตสูง ขับพยาธิ เป็นยาระบาย รักษาอาการนอนไม่หลับ\r\nผลหรือฝัก รสขม เป็นยาระบาย แก้พิษไข้เพื่อน้ำดี พิษไข้เพื่อเสมหะ แก้ไข้พิษเพื่อเอ็นตึง แก้ลมขึ้นเบื้องสูง เบื้องบน โลหิตขึ้นเบื้องบน ทำให้ระส่ำระสายในท้อง\r\nเปลือกผลหรือเปลือกฝัก รสขมเฝื่อน แก้เส้นเอ็นพิการ แก้เส้นเอ็นตึง แก้กระษัย\r\nกระพี้ รสขมเฝื่อน แก้กระษัยเส้นเอ็น ถอนพิษไข้ แก้ร้อนใน กระสับกระส่าย\r\nข้อควรระวัง\r\nการรับประทานขี้เหล็กในลักษณะที่นำใบขี้เหล็กไปตากแห้งแล้วบรรจุเป็นเม็ด อาจทำให้เกิดการเสื่อมและการตายของเซลล์ตับ หรืออาจทำให้เกิดภาวะตับอักเสบ ทำให้เกิดโรคตับได้\r\n\r\n'),
(10507, 'ใบ เป็นใบเดี่ยวเรียงสลับเวียนเป็นเกลียวขึ้นไปจนถึงยอด ลักษณะใบยาวเรียวคล้ายใบหอก ปลายใบแหลม ขอบใบเรียบ ผิวใบเป็นมัน เส้นกลางใบเว้าลึกเป็นแอ่ง ถ้าดูด้านท้องใบจะเห็นเป็นรูปคล้ายกระดูกงูเรือ ใบมีกลิ่นหอม', '', '', 'เป็นพืชใบเลี้ยงเดี่ยวลักษณะแตกกอเป็นพุ่มขนาดเล็ก ลำต้นเป็นข้อ ใบออกเป็นพุ่มบริเวณปลายยอด', '', 'เป็นพืชที่มีถิ่นกำเนิดในเอเชียตะวันออกเฉียงใต้อาทิ ไทย พม่า ลาว มาเลเซีย และประเทศอินเดีย รวมถึงทวีปอื่น เช่น แอฟริกา และออสเตรเลีย ชอบขึ้นตามพื้นที่ชุ่ม ริมลำน้ำหรือบริเวณที่ชื้นแฉะที่มีน้ำขังเล็กน้อย เตยสารมารถขยายพันธุ์ได้เองโดยการแตกหน่อ แต่ในปัจจุบันก็สามารถปลูกด้วยการแยกเหง้าหรือย้ายหน่อปลูกได้เช่นกัน', 'ใบสด\r\n-	ใช้ใบสดผสมในอาหารหรือนำมาคั้นน้ำรับประทาน เป็นยาบำรุงหัวใจ\r\n-	นำใบเตยมาตำแล้วมาพอกบนผิวรักษาโรคหัดหรือโรคผิวหนัง\r\n-	ใช้ราก 1 กำมือนำไปต้มเป็นน้ำดื่มใช้รักษาโรคเบาหวาน ขับปัสสาวะ แก้กระษัย\r\n-	นำใบเตยล้างให้สะอาด หั่นเป็นชิ้นเล็ก ๆ นำมาปั่นรวมกับน้ำสะอาดจนละเอียด จะได้ครีมข้นเหนียวแล้วนำมาพอกหน้าทิ้งไว้ประมาณ 20 นาที ใช้บำรุงผิวหน้า\r\nข้อควรระวัง\r\n-	ถึงแม้ว่าเตยจะเป็นพืชจากธรรมชาติ แต่ก็ควรบริโภคในปริมาณที่เหมาะสมและไม่บริโภคเป็นระยะเวลานานจนเกินไป\r\n-	ผู้ที่มีโรคประจำตัวหรือสตรีมีครรภ์และสตรีให้นมบุตรควรปรึกษาแพทย์และผู้เชี่ยวชาญก่อนบริโภคหรือใช้ผลิตภัณฑ์ใด ๆจากเตย เพราะสารเคมีในเตยอาจส่งผลกระทบต่อสุขภาพได้\r\n-	ในขั้นตอนการเตรียมการใช้ใบเตยด้วยตนเองควรล้างทำความสะอาดใบเตยอย่างดีอย่าให้มีสิ่งแปลกปลอมปน เพราะอาจเกิดอันตรายต่อสุขภาพได้\r\n'),
(10508, 'ใบ เป็นใบรวม ประกอบด้วยใบย่อย 2-3 คู่ ขอบใบจะหยัก เป็นแฉกลึก แต่ละแฉกนั้น เป็นรูปสามเหลี่ยม หรือห้าเหลี่ยม', 'ดอก ออกเป็นช่อคล้ายซี่ร่ม ตรงยอดดอกนั้นแผ่ เป็นรัศมี ดอกมีขนาดเล็ก เป็นดอกสมบูรณ์ เพศ', 'ผล มีลักษณะกลมรี ขนาดเล็กสีน้ำตาลอ่อน มี กลิ่นหอม จะให้ผลเพียงครั้งเดียว', 'เป็นไม้ล้มลุกจะมีอายุได้นานประมาณ 1-2 ปี และมีกลิ่นหอมทั้งต้น ส่วนลำต้นนั้นจะกลวง สูงประมาณ 30-50 ซม.', '', 'ขึ้นฉ่ายเป็นพืชที่มีถิ่นกำเนิดในทวีปยุโรปและอเมริกาเหนือ เช่น ประเทศสวีเดน , แอลจีเรีย และประเทศอียิปต์ แต่อีกข้อมูลหนึ่งเชื่อกันว่าถิ่นกำเนิดดั้งเดิมของขึ้นฉ่ายอยู่ในทวีปเอเชีย ได้แก่ ในประเทศจีน และเขตอบอุ่นในแถบเอเชียตะวันออก ขึ้นฉ่ายสามารถขยายพันธุ์ได้โดยการใช้เมล็ด', 'ต้น \r\n-	ใช้ทั้งต้นสด 1 กำมือ นำมาตำ คั้นเอาแต่น้ำผสมกับน้ำผึ้ง 1 ช้อนโต๊ะรับประทานหรืออาจจะใช้รับประทานสดเป็นผักสลัดช่วยลดความดัน\r\n-	ใช้ทั้งต้นสด 1 กำมือ ต้มกับน้ำดื่ม หรือใช้ผัด และทำสลัดรับประทานช่วยขับปัสสาวะ\r\n-	ใช้ผักขึ้นฉ่ายประมาณ 3-4 ต้น นำมาต้มกับน้ำ 1 ลิตร ดื่มครั้งละ 1 แก้ว วันละ 3 ครั้ง รักษาโรครูมาติกและโรคเกาต์\r\nข้อควรระวัง\r\n-	การใช้ขึ้นฉ่ายเพื่อต้องการสรรพคุณทางยา ควรใช้ตามขนาดที่ระบุไว้ในตำรับยาต่างๆไม่ควรใช้ในปริมาณที่มากเกินไป หรือใช้ติดต่อกันนานจนเกินไป เพราะอาจส่งผลกระทบต่อสุขภาพได้\r\n-	หญิงตั้งครรภ์ควรหลีกเลี่ยงการรับประทานขึ้นฉ่ายในปริมาณมากทุกรูปแบบ เพราะอาจทำให้มดลูกหดตัวและเสี่ยงต่อภาวะแท้ง\r\n-	ขึ้นฉ่ายอาจเพิ่มความเสี่ยงให้มีเลือดออกง่ายขึ้นและอาจทำให้ความดันเลือดลดต่ำลง เมื่อรับประทานในปริมาณมากดังนั้น ผู้ที่มีภาวะเลือดออกผิดปกติและผู้ที่มีภาวะความดันต่ำจึงควรระมัดระวังในการรับประทาน\r\n-	ยาบางชนิดอาจทำปฏิกิริยากับขึ้นฉ่าย เช่น ยาเลโวไทรอกซีน ยาลิเทียม ยาระงับประสาทหรือยาที่ออกฤทธิ์ให้เกิดอาการง่วงซึม เป็นต้น รวมถึงผู้ที่รับประทานยาเป็นประจำหรือมีโรคประจำตัว ควรปรึกษาแพทย์ก่อนจะรับประทานขึ้นฉ่ายเพื่อเป็นยารักษาโรค\r\n-	ผู้ที่แพ้พืชในวงศ์ UMBELLIFERAE ควรหลีกเลี่ยงในการรับปรทานขึ้นฉ่ายทุกรูปแบบ\r\n'),
(10509, 'ใบ เป็นใบประกอบที่มีใบย่อยใบเดี่ยว ออกเรียงสลับ ปลายใบและโคนใบมน ขอบใบเรียบ แผ่นใบเรียบเป็นมันสีเขียวเข้ม มีต่อมน้ำมันอยู่ตามผิวใบ มีกลิ่นหอมเฉพาะ ก้านใบมีปีกดูคล้ายใบ ', 'ดอก ออกเป็นช่อตามซอกใบที่ปลายกิ่ง ดอกสีขาว กลีบเลี้ยงมี 5 กลีบ กลีบดอกมี 5 แฉก โคนกลีบดอกติดกัน ', 'ผล เป็นรูปทรงกลมหรือรูปไข่ โคนผลเรียวเป็นจุก ผิวขรุขระ มีต่อมน้ำมัน ผลอ่อนสีเขียวแก่ สุกเป็นสีเหลือง มีรสเปรี้ยว เมล็ดกลมรี สีขาว มีหลายเมล็ด', 'ไม้ต้นขนาดเล็ก สูง 2-8 เมตร เปลือกต้นเรียบ สีน้ำตาล มีหนามแหลมตามกิ่งก้าน ', '', 'มะกรูดเป็นพืชตระกูลส้ม และมะนาวเป็นพืชพื้นเมืองในเขตร้อนชื้นแถบประเทศเอเชียตะวันออกเฉียงใต้ เช่น ไทย พม่า ลาว กัมพูชา ฯลฯ การขยายพันธุ์มะกรูดสามารถทำได้ด้วยหลายวิธี เช่น การตอนกิ่ง การทาบกิ่ง การติดตา การต่อยอด และการเพาะเมล็ด แต่วิธีที่เป็นที่นิยม ได้แก่ การตอนกิ่ง การต่อยอด และการเพาะด้วยเมล็ด', 'ใบ มีกลิ่นหอม แก้ไอ แก้อาเจียนเป็นโลหิต แก้ช้ำใน กัดเสมหะในคอ แก้น้ำลายเหนียว กัดเถาดานในท้อง แก้ระดูเสียฟอกโลหิตระดู ขับระดู ขับลมในลำไส้ แก้จุกเสียด \r\nผิว มีรสปร่าหอม ร้อน เป็นยาขับลมในลำไส้ แก้แน่น ขับระดู ขับผายลม เป็นยาบำรุงหัวใจ\r\nผล \r\n-	ดองเป็นยาฟอกเลือดในสตรี ช่วยขับระดู ขับลมในลำไส้ แก้จุกเสียด ลักปิดลักเปิด\r\n-	ปิ้งไฟให้สุก ผ่าครึ่งลูก เอาถูฟอกสระผม ทำให้ผมดกดำเป็นเงางาม นิ่มสลวย แก้คัน แก้รังแค\r\n-	น้ำผลมะกรูด มีรสเปรี้ยว แก้เสมหะในลำคอ แก้เลือดออกตามไรฟัน ฟอกโลหิตระดู ขับลมในลำไส้ และใช้ถนอมยาไม่ให้บูดเน่า แก้อาการท้องอืด ช่วยเจริญอาหาร\r\nข้อควรระวัง\r\n-	การใช้น้ำมันหอมระเหยมะกรูดกับผิวหนังในปริมาณที่มาก  ต้องหลีกเลี่ยงการสัมผัสแสงเนื่องจากน้ำมันที่ได้จากการบีบผิวผล อาจทำให้เกิดพิษเมื่อสัมผัสกับแสงได้ และเกิดมีสารสีเกินที่ผิวหนัง บริเวณใบหน้า และลำคอ เพราะมีสารกลุ่มคูมาริน แต่น้ำมันจากผิวผลที่ได้จากการกลั่นจะไม่มีสารนี้  น้ำ\r\n-	มะกรูดมีความเป็นกรดสูง จึงควรระมัดระวังการรับประทานขณะท้องว่าง เพราะอาจก่อให้เกิดการระคายเคืองต่อระบบทางเดินอาหารได้\r\n');

-- --------------------------------------------------------

--
-- Table structure for table `feedherb`
--

CREATE TABLE `feedherb` (
  `feedID` int(11) NOT NULL,
  `feedTxt` text DEFAULT NULL,
  `feedImg` varchar(255) DEFAULT NULL,
  `feedStar` int(6) DEFAULT NULL,
  `time_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `feedherb`
--

INSERT INTO `feedherb` (`feedID`, `feedTxt`, `feedImg`, `feedStar`, `time_at`) VALUES
(30500, 'ทดสอบ', '732879046.jpg', 5, '2022-06-08 04:44:25');

-- --------------------------------------------------------

--
-- Table structure for table `herbname`
--

CREATE TABLE `herbname` (
  `herbID` int(11) NOT NULL,
  `nameShow` varchar(100) DEFAULT '',
  `herbImg` varchar(255) DEFAULT '',
  `scienceName` varchar(255) DEFAULT '',
  `familyHerb` varchar(255) DEFAULT '',
  `commonName` varchar(255) DEFAULT '',
  `localName` varchar(255) DEFAULT '',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `herbname`
--

INSERT INTO `herbname` (`herbID`, `nameShow`, `herbImg`, `scienceName`, `familyHerb`, `commonName`, `localName`, `created_at`) VALUES
(10500, 'ตำลึง', 'a_1138682841.png', 'Coccinia grandis (L.) Voigt', 'CUCURBITACEAE', 'Ivy gourd ,Scarlet-fruited ,Scarlet ground', 'แคเด๊าะ ผักแคบ ผักตำนิน สี่บาท', '2022-06-08 04:20:53'),
(10501, 'ว่านหางจระเข้', 'a_1248765146.png', 'Aloe vera (L.) Burm.f.', 'ASPHODELACEAE', 'Star cactus, Aloe, Aloin, Jafferabad, Barbados', 'ว่านไฟไหม้,	ว่านหางจระเข้, หางตะเข้', '2022-06-08 04:24:51'),
(10502, 'ตะไคร้', 'a_198575009.png', 'Cymbopogon citratus Stapf.', 'GRAMINEAE', 'Lapine, Lemon grass', 'คาหอม ห่อวอตะโป่ จะไคร	ตะไคร้	ไคร เหลอะเกรย, เซิดเกรย หัวสิงไค', '2022-06-08 04:26:38'),
(10503, 'พลู', 'a_1193445715.png', 'Piper betle Linn.', 'PIPERACEAE', 'Betel pepper.', 'พลูเหลือง, พลูทอง, พลูจีน , เปล้าอ้วน, ซีเก๊ะ , ซีเก๊าะ , กื่อเจี่ย , จวีเจียง', '2022-06-08 04:29:23'),
(10504, 'กะเพรา', 'a_1157304123.png', 'Ocimum tenuiflorum L.', 'LABIATAE', 'Holy basil, Thai basil, Sacred basil.', 'ก้อมก้อ, ก้อมก้อดง, ห่อกวอซู, ห่อตูปลู, อิ่มคิมหลำ, กะเพรา, กะเพราขน, กะเพราขาว, กะเพราแดง, อีตู่ไทย', '2022-06-08 04:31:30'),
(10505, 'โหระพา', 'a_1531566028.png', 'Ocimum basilicum Linn.', 'LABIATAE', 'Common Basil, Sweet Basil', 'ห่อกวยซวย, โหระพาไทย, ห่อวอซุ', '2022-06-08 04:33:11'),
(10506, 'ขี้เหล็ก', 'a_1237206664.png', 'Senna siamea (Lam.) Irwin & Barneby.', 'FABACEAE (LEGUMINOSAE-CAESALPINIOIDEAE)', 'Cassod tree, Thai copper pod.', 'ขี้เหล็กหลวง ขี้เหล็กใหญ่ ผักจี้ลี้ แมะขี้เหละพะโดะ ยะหา ขี้เหล็กบ้าน ขี้เหล็ก ขี้เหล็กแก่น', '2022-06-08 04:36:49'),
(10507, 'เตย เตยหอม', 'a_1629732688.png', 'Pandanus amaryllifolius Roxb.', 'PANDACEAE', 'Pandan leaves, Fragrant pandan, Pandom wangi', 'ใบเตย , เตยหอม , ต้นเตย , เตยหอมใหญ่ , เตยหอมเล็ก (ภาคกลาง) , หวานข้าวใหม่ (ภาคเหนือ) , ปาแนะวอวิง , ปาแง๊ะออริง (นราธิวาส,มาเลเซีย) ,พังลั้ง (จีน)', '2022-06-08 04:38:43'),
(10508, 'ขึ้นฉ่าย', 'a_973427113.png', 'Apium graveolens Linn. ', 'Apiaceae ', 'Cerely, Garden Cerely , Smallage , Root Celery, Turnip-Rooted Celery', 'คื่นช่าย , คื่นฉ่าย , คื่นไช่ (ทั่วไป),ผักกันปืน , ผักปืน , ผักปืม , ผักขาวปืน (ภาคเหนือ) , ขึ่งฉ่าย , ฮั่งขึ่ง (จีนแต้จิ๋ว),ฉินช่าน , ฮั่นฉิน (จีนกลาง)', '2022-06-08 04:41:37'),
(10509, 'มะกรูด', 'a_634548844.png', 'Citrus hystrix DC.', 'RUTACEAE', 'Kaffir lime , Mauritius papeda , Leech lime', 'ท้องถิ่น  มะขูด , มะขุน (ภาคเหนือ) , ส้มมั่วผี , ส้มกรูด (ภาคใต้) , โกร้ยเชีด (เขมร) , มะขู (แม่ฮ่องสอน)', '2022-06-08 04:43:09');

-- --------------------------------------------------------

--
-- Table structure for table `imgfeature`
--

CREATE TABLE `imgfeature` (
  `herbID` int(11) NOT NULL,
  `leavesx` varchar(255) DEFAULT '',
  `flowerx` varchar(255) DEFAULT '',
  `fruitx` varchar(255) DEFAULT '',
  `haulmx` varchar(255) DEFAULT '',
  `rootHerbx` varchar(255) DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `imgfeature`
--

INSERT INTO `imgfeature` (`herbID`, `leavesx`, `flowerx`, `fruitx`, `haulmx`, `rootHerbx`) VALUES
(10500, 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif'),
(10501, 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif'),
(10502, 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif'),
(10503, 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif'),
(10504, 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif'),
(10505, 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif'),
(10506, 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif'),
(10507, 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif'),
(10508, 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif'),
(10509, 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif', 'loadimg.gif');

-- --------------------------------------------------------

--
-- Table structure for table `ratestar`
--

CREATE TABLE `ratestar` (
  `ratefive` int(6) NOT NULL DEFAULT 0,
  `ratefour` int(6) NOT NULL DEFAULT 0,
  `ratethree` int(6) NOT NULL DEFAULT 0,
  `ratetwo` int(6) NOT NULL DEFAULT 0,
  `rateone` int(6) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `ratestar`
--

INSERT INTO `ratestar` (`ratefive`, `ratefour`, `ratethree`, `ratetwo`, `rateone`) VALUES
(2, 1, 1, 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `statuss`
--

CREATE TABLE `statuss` (
  `herbID` int(11) NOT NULL,
  `feature_leaves` tinyint(1) DEFAULT 1,
  `feature_flower` tinyint(1) DEFAULT 1,
  `feature_fruit` tinyint(1) DEFAULT 1,
  `feature_haulm` tinyint(1) DEFAULT 1,
  `feature_rootHerb` tinyint(1) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `statuss`
--

INSERT INTO `statuss` (`herbID`, `feature_leaves`, `feature_flower`, `feature_fruit`, `feature_haulm`, `feature_rootHerb`) VALUES
(10500, 1, 1, 1, 1, 0),
(10501, 1, 1, 1, 0, 0),
(10502, 1, 1, 1, 1, 0),
(10503, 1, 1, 1, 1, 0),
(10504, 1, 1, 1, 1, 0),
(10505, 0, 1, 1, 1, 0),
(10506, 1, 1, 1, 1, 0),
(10507, 1, 0, 0, 1, 0),
(10508, 1, 1, 1, 1, 0),
(10509, 1, 1, 1, 1, 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `accountpm`
--
ALTER TABLE `accountpm`
  ADD PRIMARY KEY (`addminID`);

--
-- Indexes for table `detail`
--
ALTER TABLE `detail`
  ADD PRIMARY KEY (`herbID`);

--
-- Indexes for table `feedherb`
--
ALTER TABLE `feedherb`
  ADD PRIMARY KEY (`feedID`);

--
-- Indexes for table `herbname`
--
ALTER TABLE `herbname`
  ADD PRIMARY KEY (`herbID`);

--
-- Indexes for table `imgfeature`
--
ALTER TABLE `imgfeature`
  ADD PRIMARY KEY (`herbID`);

--
-- Indexes for table `statuss`
--
ALTER TABLE `statuss`
  ADD PRIMARY KEY (`herbID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `accountpm`
--
ALTER TABLE `accountpm`
  MODIFY `addminID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62500;

--
-- AUTO_INCREMENT for table `detail`
--
ALTER TABLE `detail`
  MODIFY `herbID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10510;

--
-- AUTO_INCREMENT for table `feedherb`
--
ALTER TABLE `feedherb`
  MODIFY `feedID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30501;

--
-- AUTO_INCREMENT for table `herbname`
--
ALTER TABLE `herbname`
  MODIFY `herbID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10510;

--
-- AUTO_INCREMENT for table `imgfeature`
--
ALTER TABLE `imgfeature`
  MODIFY `herbID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10510;

--
-- AUTO_INCREMENT for table `statuss`
--
ALTER TABLE `statuss`
  MODIFY `herbID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10510;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
